# Position Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProgressChangedEventArgs..::..Position Property
ProgressChangedEventArgs Class See Also
---
Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int Position { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Position As Integer
	Get
```

Visual C++
---
```text
public:
property int Position {
	int get ();
}
```

# See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace